7767517
353 382
Input                                                                                                                                                                                                                                                            data                                                                                                                                                                                                                                                             0 1 data 0=1024 1=512 2=3
Split            splitncnn_0      1 2 data data_splitncnn_0 data_splitncnn_1
Convolution                                                                                                                                                                                                                                                      conv0_1                                                                                                                                                                                                                                                          1 1 data_splitncnn_1 conv0_1 0=13 1=3 2=1 3=2 4=-233 14=-233 5=1 6=351
Pooling                                                                                                                                                                                                                                                          pool0_1                                                                                                                                                                                                                                                          1 1 data_splitncnn_0 pool0_1 0=0 1=2 2=2 3=0 4=0
Concat                                                                                                                                                                                                                                                           concat0_1                                                                                                                                                                                                                                                        2 1 conv0_1 pool0_1 concat0_1 0=0
Scale                                                                                                                                                                                                                                                            bn0_1                                                                                                                                                                                                                                                            1 1 concat0_1 bn0_1 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu0_1                                                                                                                                                                                                                                                         1 1 bn0_1 prelu0_1 0=16
Split            splitncnn_1      1 3 prelu0_1 prelu0_1_splitncnn_0 prelu0_1_splitncnn_1 prelu0_1_splitncnn_2
Convolution                                                                                                                                                                                                                                                      conv1_0_0                                                                                                                                                                                                                                                        1 1 prelu0_1_splitncnn_2 conv1_0_0 0=16 1=2 2=1 3=2 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_0_0                                                                                                                                                                                                                                                          1 1 conv1_0_0 bn1_0_0 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu1_0_0                                                                                                                                                                                                                                                       1 1 bn1_0_0 prelu1_0_0 0=16
Convolution                                                                                                                                                                                                                                                      conv1_0_1                                                                                                                                                                                                                                                        1 1 prelu1_0_0 conv1_0_1 0=16 1=3 2=1 3=1 4=-233 14=-233 5=1 6=2304
Scale                                                                                                                                                                                                                                                            bn1_0_1                                                                                                                                                                                                                                                          1 1 conv1_0_1 bn1_0_1 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu1_0_1                                                                                                                                                                                                                                                       1 1 bn1_0_1 prelu1_0_1 0=16
Convolution                                                                                                                                                                                                                                                      conv1_0_2                                                                                                                                                                                                                                                        1 1 prelu1_0_1 conv1_0_2 0=64 1=1 2=1 3=1 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_0_2                                                                                                                                                                                                                                                          1 1 conv1_0_2 bn1_0_2 0=64 1=1
Dropout                                                                                                                                                                                                                                                          drop1_0_3                                                                                                                                                                                                                                                        1 1 bn1_0_2 drop1_0_3
Pooling                                                                                                                                                                                                                                                          pool1_0_4                                                                                                                                                                                                                                                        1 1 prelu0_1_splitncnn_1 pool1_0_4 0=0 1=2 2=2 3=0 4=0
Convolution                                                                                                                                                                                                                                                      conv1_0_4                                                                                                                                                                                                                                                        1 1 pool1_0_4 conv1_0_4 0=64 1=1 2=1 3=1 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_0_4                                                                                                                                                                                                                                                          1 1 conv1_0_4 bn1_0_4 0=64 1=1
Eltwise                                                                                                                                                                                                                                                          eltwise1_0_4                                                                                                                                                                                                                                                     2 1 drop1_0_3 bn1_0_4 eltwise1_0_4 0=1 -23301=0
PReLU                                                                                                                                                                                                                                                            prelu1_0_4                                                                                                                                                                                                                                                       1 1 eltwise1_0_4 prelu1_0_4 0=64
Split            splitncnn_2      1 2 prelu1_0_4 prelu1_0_4_splitncnn_0 prelu1_0_4_splitncnn_1
Convolution                                                                                                                                                                                                                                                      conv1_1_0                                                                                                                                                                                                                                                        1 1 prelu1_0_4_splitncnn_1 conv1_1_0 0=16 1=1 2=1 3=1 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_1_0                                                                                                                                                                                                                                                          1 1 conv1_1_0 bn1_1_0 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu1_1_0                                                                                                                                                                                                                                                       1 1 bn1_1_0 prelu1_1_0 0=16
Convolution                                                                                                                                                                                                                                                      conv1_1_1                                                                                                                                                                                                                                                        1 1 prelu1_1_0 conv1_1_1 0=16 1=3 2=1 3=1 4=-233 14=-233 5=1 6=2304
Scale                                                                                                                                                                                                                                                            bn1_1_1                                                                                                                                                                                                                                                          1 1 conv1_1_1 bn1_1_1 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu1_1_1                                                                                                                                                                                                                                                       1 1 bn1_1_1 prelu1_1_1 0=16
Convolution                                                                                                                                                                                                                                                      conv1_1_2                                                                                                                                                                                                                                                        1 1 prelu1_1_1 conv1_1_2 0=64 1=1 2=1 3=1 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_1_2                                                                                                                                                                                                                                                          1 1 conv1_1_2 bn1_1_2 0=64 1=1
Dropout                                                                                                                                                                                                                                                          drop1_1_3                                                                                                                                                                                                                                                        1 1 bn1_1_2 drop1_1_3
Eltwise                                                                                                                                                                                                                                                          eltwise1_1_4                                                                                                                                                                                                                                                     2 1 drop1_1_3 prelu1_0_4_splitncnn_0 eltwise1_1_4 0=1 -23301=0
PReLU                                                                                                                                                                                                                                                            prelu1_1_4                                                                                                                                                                                                                                                       1 1 eltwise1_1_4 prelu1_1_4 0=64
Split            splitncnn_3      1 2 prelu1_1_4 prelu1_1_4_splitncnn_0 prelu1_1_4_splitncnn_1
Convolution                                                                                                                                                                                                                                                      conv1_2_0                                                                                                                                                                                                                                                        1 1 prelu1_1_4_splitncnn_1 conv1_2_0 0=16 1=1 2=1 3=1 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_2_0                                                                                                                                                                                                                                                          1 1 conv1_2_0 bn1_2_0 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu1_2_0                                                                                                                                                                                                                                                       1 1 bn1_2_0 prelu1_2_0 0=16
Convolution                                                                                                                                                                                                                                                      conv1_2_1                                                                                                                                                                                                                                                        1 1 prelu1_2_0 conv1_2_1 0=16 1=3 2=1 3=1 4=-233 14=-233 5=1 6=2304
Scale                                                                                                                                                                                                                                                            bn1_2_1                                                                                                                                                                                                                                                          1 1 conv1_2_1 bn1_2_1 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu1_2_1                                                                                                                                                                                                                                                       1 1 bn1_2_1 prelu1_2_1 0=16
Convolution                                                                                                                                                                                                                                                      conv1_2_2                                                                                                                                                                                                                                                        1 1 prelu1_2_1 conv1_2_2 0=64 1=1 2=1 3=1 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_2_2                                                                                                                                                                                                                                                          1 1 conv1_2_2 bn1_2_2 0=64 1=1
Dropout                                                                                                                                                                                                                                                          drop1_2_3                                                                                                                                                                                                                                                        1 1 bn1_2_2 drop1_2_3
Eltwise                                                                                                                                                                                                                                                          eltwise1_2_4                                                                                                                                                                                                                                                     2 1 drop1_2_3 prelu1_1_4_splitncnn_0 eltwise1_2_4 0=1 -23301=0
PReLU                                                                                                                                                                                                                                                            prelu1_2_4                                                                                                                                                                                                                                                       1 1 eltwise1_2_4 prelu1_2_4 0=64
Split            splitncnn_4      1 2 prelu1_2_4 prelu1_2_4_splitncnn_0 prelu1_2_4_splitncnn_1
Convolution                                                                                                                                                                                                                                                      conv1_3_0                                                                                                                                                                                                                                                        1 1 prelu1_2_4_splitncnn_1 conv1_3_0 0=16 1=1 2=1 3=1 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_3_0                                                                                                                                                                                                                                                          1 1 conv1_3_0 bn1_3_0 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu1_3_0                                                                                                                                                                                                                                                       1 1 bn1_3_0 prelu1_3_0 0=16
Convolution                                                                                                                                                                                                                                                      conv1_3_1                                                                                                                                                                                                                                                        1 1 prelu1_3_0 conv1_3_1 0=16 1=3 2=1 3=1 4=-233 14=-233 5=1 6=2304
Scale                                                                                                                                                                                                                                                            bn1_3_1                                                                                                                                                                                                                                                          1 1 conv1_3_1 bn1_3_1 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu1_3_1                                                                                                                                                                                                                                                       1 1 bn1_3_1 prelu1_3_1 0=16
Convolution                                                                                                                                                                                                                                                      conv1_3_2                                                                                                                                                                                                                                                        1 1 prelu1_3_1 conv1_3_2 0=64 1=1 2=1 3=1 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_3_2                                                                                                                                                                                                                                                          1 1 conv1_3_2 bn1_3_2 0=64 1=1
Dropout                                                                                                                                                                                                                                                          drop1_3_3                                                                                                                                                                                                                                                        1 1 bn1_3_2 drop1_3_3
Eltwise                                                                                                                                                                                                                                                          eltwise1_3_4                                                                                                                                                                                                                                                     2 1 drop1_3_3 prelu1_2_4_splitncnn_0 eltwise1_3_4 0=1 -23301=0
PReLU                                                                                                                                                                                                                                                            prelu1_3_4                                                                                                                                                                                                                                                       1 1 eltwise1_3_4 prelu1_3_4 0=64
Split            splitncnn_5      1 2 prelu1_3_4 prelu1_3_4_splitncnn_0 prelu1_3_4_splitncnn_1
Convolution                                                                                                                                                                                                                                                      conv1_4_0                                                                                                                                                                                                                                                        1 1 prelu1_3_4_splitncnn_1 conv1_4_0 0=16 1=1 2=1 3=1 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_4_0                                                                                                                                                                                                                                                          1 1 conv1_4_0 bn1_4_0 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu1_4_0                                                                                                                                                                                                                                                       1 1 bn1_4_0 prelu1_4_0 0=16
Convolution                                                                                                                                                                                                                                                      conv1_4_1                                                                                                                                                                                                                                                        1 1 prelu1_4_0 conv1_4_1 0=16 1=3 2=1 3=1 4=-233 14=-233 5=1 6=2304
Scale                                                                                                                                                                                                                                                            bn1_4_1                                                                                                                                                                                                                                                          1 1 conv1_4_1 bn1_4_1 0=16 1=1
PReLU                                                                                                                                                                                                                                                            prelu1_4_1                                                                                                                                                                                                                                                       1 1 bn1_4_1 prelu1_4_1 0=16
Convolution                                                                                                                                                                                                                                                      conv1_4_2                                                                                                                                                                                                                                                        1 1 prelu1_4_1 conv1_4_2 0=64 1=1 2=1 3=1 4=-233 14=-233 5=0 6=1024
Scale                                                                                                                                                                                                                                                            bn1_4_2                                                                                                                                                                                                                                                          1 1 conv1_4_2 bn1_4_2 0=64 1=1
Dropout                                                                                                                                                                                                                                                          drop1_4_3                                                                                                                                                                                                                                                        1 1 bn1_4_2 drop1_4_3
Eltwise                                                                                                                                                                                                                                                          eltwise1_4_4                                                                                                                                                                                                                                                     2 1 drop1_4_3 prelu1_3_4_splitncnn_0 eltwise1_4_4 0=1 -23301=0
PReLU                                                                                                                                                                                                                                                            prelu1_4_4                                                                                                                                                                                                                                                       1 1 eltwise1_4_4 prelu1_4_4 0=64
Split            splitncnn_6      1 2 prelu1_4_4 prelu1_4_4_splitncnn_0 prelu1_4_4_splitncnn_1
Convolution                                                                                                                                                                                                                                                      conv2_0_0                                                                                                                                                                                                                                                        1 1 prelu1_4_4_splitncnn_1 conv2_0_0 0=32 1=2 2=1 3=2 4=-233 14=-233 5=0 6=8192
Scale                                                                                                                                                                                                                                                            bn2_0_0                                                                                                                                                                                                                                                          1 1 conv2_0_0 bn2_0_0 0=32 1=1
PReLU                                                                                                                                                                                                                                                            prelu2_0_0                                                                                                                                                                                                                                                       1 1 bn2_0_0 prelu2_0_0 0=32
Convolution                                                                                                                                                                                                                                                      conv2_0_1                                                                                                                                                                                                                                                        1 1 prelu2_0_0 conv2_0_1 0=32 1=3 2=1 3=1 4=-233 14=-233 5=1 6=9216
Scale                                                                                                                                                                                                                                                            bn2_0_1                                                                                                                                                                                                                                                          1 1 conv2_0_1 bn2_0_1 0=32 1=1
PReLU                                                                                                                                                                                                                                                            prelu2_0_1                                                                                                                                                                                                                                                       1 1 bn2_0_1 prelu2_0_1 0=32
Convolution                                                                                                                                                                                                                                                      conv2_0_2                                                                                                                                                                                                                                                        1 1 prelu2_0_1 conv2_0_2 0=128 1=1 2=1 3=1 4=-233 14=-233 5=0 6=4096
Scale                                                                                                                                                                                                                                                            bn2_0_2                                                                                                                                                                                                                                                          1 1 conv2_0_2 bn2_0_2 0=128 1=1
Dropout                                                                                                                                                                                                                                                          drop2_0_3                                                                                                                                                                                                                                                        1 1 bn2_0_2 drop2_0_3
Pooling                                                                                                                                                                                                                                                          pool2_0_4                                                                                                                                                                                                                                                        1 1 prelu1_4_4_splitncnn_0 pool2_0_4 0=0 1=2 2=2 3=0 4=0
Convolution                                                                                                                                                                                                                                                      conv2_0_4                                                                                                                                                                                                                                                        1 1 pool2_0_4 conv2_0_4 0=128 1=1 2=1 3=1 4=-233 14=-233 5=0 6=8192
Scale                                                                                                                                                                                                                                                            bn2_0_4                                                                                                                                                                                                                                                          1 1 conv2_0_4 bn2_0_4 0=128 1=1
Eltwise                                                                                                                                                                                                                                                          eltwise2_0_4                                                                                                                                                                                                                                                     2 1 drop2_0_3 bn2_0_4 eltwise2_0_4 0=1 -23301=0
PReLU                                                                                                                                                                                                                                                            prelu2_0_4                                                                                                                                                                                                                                                       1 1 eltwise2_0_4 prelu2_0_4 0=128
Split            splitncnn_7      1 2 prelu2_0_4 prelu2_0_4_splitncnn_0 prelu2_0_4_splitncnn_1
Convolution                                                                                                                                                                                                                                                      conv2_1_0                                                                                                                                                                                                                                                        1 1 prelu2_0_4_splitncnn_1 conv2_1_0 0=32 1=1 2=1 3=1 4=-233 14=-233 5=0 6=4096
Scale                                                                                                                                                                                                                                                            bn2_1_0                                                                                                                                                                                                                                                          1 1 conv2_1_0 bn2_1_0 0=32 1=1
PReLU                                                                                                                                                                                                                                                            prelu2_1_0                                                                                                                                                                                                                                                       1 1 bn2_1_0 prelu2_1_0 0=32
Convolution                                                                                                                                                                                                                                                      conv2_1_1                                                                                                                                                                                                                                                        1 1 prelu2_1_0 conv2_1_1 0=32 1=3 2=1 3=1 4=-233 14=-233 5=1 6=9216
Scale                                                                                                                                                                                                                                                            bn2_1_1                                                                                                                                                                                                                                                          1 1 conv2_1_1 bn2_1_1 0=32 1=1
PReLU                                                                                                                                                                                                                                                            prelu2_1_1                                                                                                                                                                                                                                                       1 1 bn2_1_1 prelu2_1_1 0=32
Convolution                                                                                                                                                                                                                                                      conv2_1_2                                                                                                                                                                                                                                                        1 1 prelu2_1_1 conv2_1_2 0=128 1=1 2=1 3=1 4=-233 14=-233 5=0 6=4096
Scale                                                                                                                                                                                                                                                            bn2_1_2                                                                                                                                                                                                                                                          1 1 conv2_1_2 bn2_1_2 0=128 1=1
Dropout                                                                                                                                                                                                                                                          drop2_1_3                                                                                                                                                                                                                                                        1 1 bn2_1_2 drop2_1_3
Eltwise                                                                                                                                                                                                                                                          eltwise2_1_4                                                                                                                                                                                                                                                     2 1 drop2_1_3 prelu2_0_4_splitncnn_0 eltwise2_1_4 0=1 -23301=0
